{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "SmolVLMForConditionalGeneration",
    "parent_library": "transformers.models.smolvlm.modeling_smolvlm"
  },
  "base_model_name_or_path": "models/models--HuggingFaceTB--SmolVLM2-500M-Video-Instruct",
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": "gaussian",
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 8,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "k_proj",
    "q_proj",
    "v_proj",
    "gate_proj",
    "o_proj",
    "down_proj",
    "up_proj"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}